; --- WEAPONS ---

[Cannon_CV X2WeaponTemplate]
FriendlyName="Heavy Cannon"
FriendlyNamePlural="Heavy Cannons"
BriefSummary="The Cannon is an improvised light support weapon, specialized for high volume fire. It has a large ammo pool and deals more damage than assault rifles. They deal increased damage to environments, plowing through cover. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire without penalty.\n<Bullet/> For one action, cannons can be fired with an aim penalty, spraying bullets towards the enemy. This doesn't end the turn.\n<Bullet/> Increased damage to cover and other environmental objects."
AbilityDescName="cannon"

[Cannon_MG X2WeaponTemplate]
FriendlyName="Mag Heavy Cannon"
FriendlyNamePlural="Mag Heavy Cannons"
BriefSummary="The Cannon is an improvised light support weapon, specialized for high volume fire. It has a large ammo pool and deals more damage than assault rifles. They deal increased damage to environments, plowing through cover. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire without penalty.\n<Bullet/> For one action, cannons can be fired with an aim penalty, spraying bullets towards the enemy. This doesn't end the turn.\n<Bullet/> Increased damage to cover and other environmental objects."
AbilityDescName="cannon"

[Cannon_BM X2WeaponTemplate]
FriendlyName="Beam Heavy Cannon"
FriendlyNamePlural="Beam Heavy Cannons"
BriefSummary="The Cannon is an improvised light support weapon, specialized for high volume fire. It has a large ammo pool and deals more damage than assault rifles. They deal increased damage to environments, plowing through cover. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire without penalty.\n<Bullet/> For one action, cannons can be fired with an aim penalty, spraying bullets towards the enemy. This doesn't end the turn.\n<Bullet/> Increased damage to cover and other environmental objects."
AbilityDescName="cannon"

[SniperRifle_CV X2WeaponTemplate]
FriendlyName="Sniper Rifle"
FriendlyNamePlural="Sniper Rifles"
BriefSummary="Sniper Rifles are most accurate at range and deal considerable damage. They pierce armor, which further increases their effectiveness. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> Pierces armor."
AbilityDescName="sniper rifle"

[SniperRifle_MG X2WeaponTemplate]
FriendlyName="Gauss Rifle"
FriendlyNamePlural="Gauss Rifles"
BriefSummary="Sniper Rifles are most accurate at range and deal considerable damage. They pierce armor, which further increases their effectiveness. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> Pierces armor."
AbilityDescName="sniper rifle"

[SniperRifle_BM X2WeaponTemplate]
FriendlyName="Plasma Lance"
FriendlyNamePlural="Plasma Lances"
BriefSummary="Sniper Rifles are most accurate at range and deal considerable damage. They pierce armor, which further increases their effectiveness. As heavy weapons, they require two actions to fire and are less moddable than others."
TacticalText="<Bullet/> Requires two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> Pierces armor."
AbilityDescName="sniper rifle"

[Shotgun_CV X2WeaponTemplate]
FriendlyName="Shotgun"
FriendlyNamePlural="Shotguns"
BriefSummary="Shotguns have the most stopping power on a per shot basis, but require getting into close quarters. Their effectiveness is further enhanced by their high critical hit chance. Shotguns are cumbersome to reload."
TacticalText="<Bullet/> Reloads only a single shell per action.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Shotgun damage is unmatched, beating out even sniper rifles."
AbilityDescName="shotgun"

[Shotgun_MG X2WeaponTemplate]
FriendlyName="Shard Gun"
FriendlyNamePlural="Shard Guns"
BriefSummary="Shotguns have the most stopping power on a per shot basis, but require getting into close quarters. Their effectiveness is further enhanced by their high critical hit chance. Shotguns are cumbersome to reload."
TacticalText="<Bullet/> Reloads only a single shell per action.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Shotgun damage is unmatched, beating out even sniper rifles."
AbilityDescName="shotgun"

[Shotgun_BM X2WeaponTemplate]
FriendlyName="Storm Gun"
FriendlyNamePlural="Storm Guns"
BriefSummary="Shotguns have the most stopping power on a per shot basis, but require getting into close quarters. Their effectiveness is further enhanced by their high critical hit chance. Shotguns are cumbersome to reload."
TacticalText="<Bullet/> Reloads only a single shell per action.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Shotgun damage is unmatched, beating out even sniper rifles."
AbilityDescName="shotgun"

[AssaultRifle_CV X2WeaponTemplate]
FriendlyName="Assault Rifle"
FriendlyNamePlural="Assault Rifles"
BriefSummary="Assault Rifles set the baseline for how a weapon operates. They are able to perform in almost any situation, but excel at almost none."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_MG X2WeaponTemplate]
FriendlyName="Magnetic Rifle"
FriendlyNamePlural="Magnetic Rifles"
BriefSummary="Magnetized projectile tech has enabled us to create rifle-style slugthrowers. They represent a substantial improvement in power relative to conventional assault rifles."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnetic Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_BM X2WeaponTemplate]
FriendlyName="Plasma Rifle"
FriendlyNamePlural="Plasma Rifles"
BriefSummary="Now that we've finally deciphered the aliens' devastating weapon technology and can develop beam weapons of our own, we can build rifles that will be the match of any enemy our soldiers encounter in the field."
TacticalText="<Bullet/> The Plasma Rifle is a general purpose, supremely powerful primary infantry weapons system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Use upgrades looted from enemies to improve the Plasma Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

; -- ADVENT WEAPONS

[SMG_CV X2WeaponTemplate]
FriendlyName="ADVENT SMG"
FriendlyNamePlural="ADVENT SMGs"
BriefSummary="Submachine guns can be used with Strafing Shot, which allows for a bonus move after shooting. They are built for short range. Submachine guns have innate bonuses to crit damage and crit chance."
TacticalText="<Bullet/>These weapons use the same range table as shotguns. \n<Bullet/> SMGs are best used for hit and run attacks in close quarters."
AbilityDescName="SMG"

[SMG_MG X2WeaponTemplate]
FriendlyName="Advanced SMG"
FriendlyNamePlural="Advanced SMGs"
BriefSummary="Submachine guns can be used with Strafing Shot, which allows for a bonus move after shooting. They are built for short range. Submachine guns have innate bonuses to crit damage and crit chance."
TacticalText="<Bullet/>These weapons use the same range table as shotguns. \n<Bullet/> SMGs are best used for hit and run attacks in close quarters."
AbilityDescName="SMG"

[SMG_BM X2WeaponTemplate]
FriendlyName="Elite SMG"
FriendlyNamePlural="Elite SMGs"
BriefSummary="Submachine guns can be used with Strafing Shot, which allows for a bonus move after shooting. They are built for short range. Submachine guns have innate bonuses to crit damage and crit chance."
TacticalText="<Bullet/>These weapons use the same range table as shotguns. \n<Bullet/> SMGs are best used for hit and run attacks in close quarters."
AbilityDescName="SMG"

[Scoutrifle_CV X2WeaponTemplate]
FriendlyName="ADVENT Scoutrifle"
FriendlyNamePlural="ADVENT Scoutrifles"
BriefSummary="Scoutrifles are very light sniper rifles. While their damage is lower and they lose precision at squad sight range, they don't count as heavy weapons and can be fired for one action."
TacticalText="<Bullet/>These weapons use the same range table as sniper rifles. \n<Bullet/> Scoutrifles are best used for mobile fire support from afar."
AbilityDescName="sniperrifle"

[Scoutrifle_MG X2WeaponTemplate]
FriendlyName="Advanced Scoutrifle"
FriendlyNamePlural="Advanced Scoutrifles"
BriefSummary="Scoutrifles are very light sniper rifles. While their damage is lower and they lose precision at squad sight range, they don't count as heavy weapons and can be fired for one action."
TacticalText="<Bullet/>These weapons use the same range table as sniper rifles. \n<Bullet/> Scoutrifles are best used for mobile fire support from afar."
AbilityDescName="sniperrifle"

[Scoutrifle_BM X2WeaponTemplate]
FriendlyName="Elite Scoutrifle"
FriendlyNamePlural="Elite Scoutrifles"
BriefSummary="Scoutrifles are very light sniper rifles. While their damage is lower and they lose precision at squad sight range, they don't count as heavy weapons and can be fired for one action."
TacticalText="<Bullet/>These weapons use the same range table as sniper rifles. \n<Bullet/> Scoutrifles are best used for mobile fire support from afar."
AbilityDescName="sniperrifle"

[Flammenwerfer_CV X2WeaponTemplate]
FriendlyName="ADVENT Flammenwerfer"
FriendlyNamePlural="ADVENT Flammenwerfers"
BriefSummary="Flammenwerfers are a hybrid of shotgun and flamethrower. They are powered by an internal fuel tank that has high capacity but can not be reloaded in the field. "
TacticalText="<Bullet/>These weapons can be used for conventional shooting, using the same range table as shotguns. This will light the target on fire and shred their armor. \n<Bullet/>They can not be reloaded but have a high initial ammo capacity. \n<Bullet/> Flammenwerfers are very potent weapons against the Lost."
AbilityDescName="shotgun"

[Flammenwerfer_MG X2WeaponTemplate]
FriendlyName="Advanced Flammenwerfer"
FriendlyNamePlural="Advanced Flammenwerfers"
BriefSummary="Flammenwerfers are a hybrid of shotgun and flamethrower. They are powered by an internal fuel tank that has high capacity but can not be reloaded in the field."
TacticalText="<Bullet/>These weapons can be used for conventional shooting, using the same range table as shotguns. This will light the target on fire and shred their armor. \n<Bullet/>They can not be reloaded but have a high initial ammo capacity. \n<Bullet/> Flammenwerfers are very potent weapons against the Lost."
AbilityDescName="shotgun"

[Flammenwerfer_BM X2WeaponTemplate]
FriendlyName="Elite Flammenwerfer"
FriendlyNamePlural="Elite Flammenwerfers"
BriefSummary="Flammenwerfers are a hybrid of shotgun and flamethrower. They are powered by an internal fuel tank that has high capacity but can not be reloaded in the field."
TacticalText="<Bullet/>These weapons can be used for conventional shooting, using the same range table as shotguns. This will light the target on fire and shred their armor. \n<Bullet/>They can not be reloaded but have a high initial ammo capacity. \n<Bullet/> Flammenwerfers are very potent weapons against the Lost."
AbilityDescName="shotgun"

[MECCannon_CV X2WeaponTemplate]
FriendlyName="ADVENT Smartgun"
FriendlyNamePlural="ADVENT Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Smartguns also fire automatically against hostiles in close range."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing.\n"
AbilityDescName="cannon"

[MECCannon_MG X2WeaponTemplate]
FriendlyName="Advanced Smartgun"
FriendlyNamePlural="Advanced Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Smartguns also fire automatically against hostiles in close range."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing.\n"
AbilityDescName="cannon"

[MECCannon_BM X2WeaponTemplate]
FriendlyName="Elite Smartgun"
FriendlyNamePlural="Elite Smartguns"
BriefSummary="A compact cannon with electronics that allow for automatic tracking of targets. Whenever the soldier takes a standard shot, the weapon will enter Overwatch mode. Smartguns also fire automatically against hostiles in close range."
TacticalText="<Bullet/> Requires two actions to fire, but also enters Overwatch after firing.\n"
AbilityDescName="cannon"

; -- LASER AND COIL

[Laserrifle X2WeaponTemplate]
FriendlyName="Laser Rifle"
FriendlyNamePlural="Laser Rifles"
BriefSummary="A very accurate rifle that is able to penetrate basic armor with its beam. Offers consistency, but lacks potential. (Lasers are more accurate and reliable at a cost of critical damage potential. Lasers pierce armor.)"
TacticalText="<Bullet/> Laser Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Laser weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="assault rifle"

[Coilrifle X2WeaponTemplate]
FriendlyName="Coil Rifle"
FriendlyNamePlural="Coil Rifles"
BriefSummary="Coil Rifles can cause heavy damage to anything they hit, even tear down armor. They are slightly less precise than other weapons, though. (Coil weapons are less accurate, but offer great damage potential. Coil tech shreds armor.)"
TacticalText="<Bullet/> Coil Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Coil weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="assault rifle"

[LaserShotgun X2WeaponTemplate]
FriendlyName="Scatter Laser"
FriendlyNamePlural="Scatter Laser"
BriefSummary="This laser weapon dissipates its energy over a wider area with the help of refractor lenses, trading range for power. (Lasers are more accurate and reliable at a cost of critical damage potential. Lasers pierce armor.)"
TacticalText="<Bullet/> Laser Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Laser weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="shotgun"

[CoilShotgun X2WeaponTemplate]
FriendlyName="Coil Shotgun"
FriendlyNamePlural="Coil Shotguns"
BriefSummary="A direct hit with an accelerated shrapnel load from a coil shotgun will tear through armor and anything under it. (Coil weapons are less accurate, but offer great damage potential. Coil tech shreds armor.)"
TacticalText="<Bullet/> Coil Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Coil weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="shotgun"

[LaserSniper X2WeaponTemplate]
FriendlyName="Laser Lance"
FriendlyNamePlural="Laser Lance"
BriefSummary="One of the most accurate weapon in XCOMs arsenal, the Laser Sniper can project its beam over large distances without suffering from any kind of falloff. (Lasers are more accurate and reliable at a cost of critical damage potential. Lasers pierce armor.)"
TacticalText="<Bullet/> Laser Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Laser weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="sniper rifle"

[CoilSniper X2WeaponTemplate]
FriendlyName="Coil Lance"
FriendlyNamePlural="Coil Lances"
BriefSummary="Using coil tech for sniper rifles balances out some of the accuracy problems inherent to the tech. These weapons are reasonably accurate and pack a punch. (Coil weapons are less accurate, but offer great damage potential. Coil tech shreds armor.)"
TacticalText="<Bullet/> Coil Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Coil weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="sniper rifle"

[LaserCannon X2WeaponTemplate]
FriendlyName="Heavy Laser Cannon"
FriendlyNamePlural="Heavy Laser Cannons"
BriefSummary="The bulk of the heavy laser cannon's weight comes from its power source which is designed to fuel the weapon for sustained fire. (Lasers are more accurate and reliable at a cost of critical damage potential. Lasers pierce armor.)"
TacticalText="<Bullet/> Laser Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Laser weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="cannon"

[CoilCannon X2WeaponTemplate]
FriendlyName="Heavy Coil Cannon"
FriendlyNamePlural="Heavy Coil Cannons"
BriefSummary="Shredding armor, flesh and anything else in its line of fire, the sustained fire from a Coil Cannon can turn a battlefield into a wasteland. (Coil weapons are less accurate, but offer great damage potential. Coil tech shreds armor.)"
TacticalText="<Bullet/> Coil Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Coil weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="cannon"

[Pulserifle X2WeaponTemplate]
FriendlyName="Pulse Rifle"
FriendlyNamePlural="Pulse Rifles"
BriefSummary="Pulserifles are precision tools and capable of bypassing layered armor. (Pulselasers are more accurate and reliable at a cost of critical damage potential. Pulselasers pierce armor.)"
TacticalText="<Bullet/> Pulse Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Pulse weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="assault rifle"

[Railrifle X2WeaponTemplate]
FriendlyName="Rail Rifle"
FriendlyNamePlural="Rail Rifles"
BriefSummary="Rail Rifles deal severe damage while stripping down armor fast enough to leave even heavily protected targets with a few hits. (Railguns are less accurate, but offer great damage potential. Rail tech shreds armor.)"
TacticalText="<Bullet/> Rail Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Rail weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="assault rifle"

[PulseShotgun X2WeaponTemplate]
FriendlyName="Scatter Pulse"
FriendlyNamePlural="Scatter Pulse"
BriefSummary="Improvements in the output of the powersource make this pulse tech shotgun an even bigger threat in close range than its laser tech predecessor. (Pulselasers are more accurate and reliable at a cost of critical damage potential. Pulselasers pierce armor.)"
TacticalText="<Bullet/> Pulse Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Pulse weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="shotgun"

[RailShotgun X2WeaponTemplate]
FriendlyName="Rail Shotgun"
FriendlyNamePlural="Rail Shotguns"
BriefSummary="The damage potential of rail shotguns is unparalleled by anything else in our armory. (Railguns are less accurate, but offer great damage potential. Rail tech shreds armor.)"
TacticalText="<Bullet/> Rail Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Rail weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="shotgun"

[PulseSniper X2WeaponTemplate]
FriendlyName="Pulse Lance"
FriendlyNamePlural="Pulse Lance"
BriefSummary="It doesn't get more accurate than this. Pulse Snipers have been built for stability, even untrained soldiers should be able to hit at long ranges with this one. (Pulselasers are more accurate and reliable at a cost of critical damage potential. Pulselasers pierce armor.)"
TacticalText="<Bullet/> Pulse Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Pulse weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="sniper rifle"

[RailSniper X2WeaponTemplate]
FriendlyName="Rail Lance"
FriendlyNamePlural="Rail Lances"
BriefSummary="Striking a remarkable compromise between stopping power and the ability to hit the target in the first place, a rail tech sniper rifle can rain down accalerated projectiles over very long distances. (Railguns are less accurate, but offer great damage potential. Rail tech shreds armor.)"
TacticalText="<Bullet/> Rail Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Rail weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="sniper rifle"

[PulseCannon X2WeaponTemplate]
FriendlyName="Heavy Pulse Cannon"
FriendlyNamePlural="Heavy Pulse Cannons"
BriefSummary="We were able to increase the output of the power source for the laser cannon when we upgraded to pulse tech. It is still able to be fired almost continously, but at a much higher damage potential. (Pulselasers are more accurate and reliable at a cost of critical damage potential. Pulselasers pierce armor.)"
TacticalText="<Bullet/> Pulse Tech gives bonuses to aim and armor pierce, but also penalties to crit damage and chance.\n<Bullet/> Pulse weapons have narrow damage ranges, making their effects more predictable."
AbilityDescName="cannon"

[RailCannon X2WeaponTemplate]
FriendlyName="Heavy Rail Cannon"
FriendlyNamePlural="Heavy Rail Cannons"
BriefSummary="When used against armored targets, the rail cannon will tear down any protective layers within seconds. Against unarmored targets, it won't even need to. (Railguns are less accurate, but offer great damage potential. Rail tech shreds armor.)"
TacticalText="<Bullet/> Rail Tech gives bonuses to crit and armor shred, but also penalties to aim.\n<Bullet/> Rail weapons have higher damage ranges, allowing them a bigger potential impact but also risking the opposite.\n."
AbilityDescName="cannon"